Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateSlabEdgeWarn Property
 Could not create Slab Edge. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSlabEdgeWarn { get; }
Public Shared ReadOnly Property CannotCreateSlabEdgeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSlabEdgeWarn {
	FailureDefinitionId^ get ();
}
static member CannotCreateSlabEdgeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace